afantey/aft_bsp_gd32/gd32_drivers/slcd_seg_l23x.c
void slcd_icon_display(int ch, int disp)
{
    /* wait the last SLCD DATA update request finished */
    while (slcd_flag_get(SLCD_FLAG_UPR))
        ;

    switch (ch)
    {
    case LEIJI: // 累积用量字符 T2
    {
        if (disp)
            SLCD_DATA5 |= (uint32_t)(0x4000000);//com5,seg26
        else
            SLCD_DATA5 &= ~(uint32_t)(0x4000000);
        break;
    }
    case BIAOHAO: // 表号 T3
    {
        if (disp)
            SLCD_DATA6 |= (uint32_t)(0x4000000);//com6,seg26
        else
            SLCD_DATA6 &= ~(uint32_t)(0x4000000);
        break;
    }
    case TONGXIN: //通信 T4
    {
        if (disp)
            SLCD_DATA7 |= (uint32_t)(0x4000000);//com7,seg26
        else
            SLCD_DATA7 &= ~(uint32_t)(0x4000000);
        break;
    }
    case YICHANG: //异常 T5
    {
        if (disp)
            SLCD_DATA7 |= (uint32_t)(0x8000000);//com7,seg27
        else
            SLCD_DATA7 &= ~(uint32_t)(0x8000000);
        break;
    }
    case FAGUAN: //阀关
    {
        if (disp){
            SLCD_DATA5 |= (uint32_t)(0x8000000);//T7 seg27
            SLCD_DATA6 |= (uint32_t)(0x8000000);//T6
        }
        else
            SLCD_DATA5 &= ~(uint32_t)(0x8000000);
        break;
    }
    case QIANYA: //欠压 T19
    {
        if (disp)
            SLCD_DATA0 |= (uint32_t)(0x8000000);//com0,seg27
        else
            SLCD_DATA0 &= ~(uint32_t)(0x8000000);
        break;
    }
    case XIAOSHUDIAN: //小数点
    {
        if (disp)
        {
            SLCD_DATA3 |= (uint32_t)(0x1000);//T12
            SLCD_DATA3 |= (uint32_t)(0x4000);//T13
            SLCD_DATA3 |= (uint32_t)(0x8000);//T14
            SLCD_DATA3 |= (uint32_t)(0x2000000);//T15
        }
        else
        {
            SLCD_DATA3 &= ~(uint32_t)(0x1000);
            SLCD_DATA3 &= ~(uint32_t)(0x4000);
            SLCD_DATA3 &= ~(uint32_t)(0x8000);
            SLCD_DATA3 &= ~(uint32_t)(0x2000000);
        }
        break;
    }
    case m3: //T18
    {
        if (disp)
            SLCD_DATA1 |= (uint32_t)(0x8000000);//com1,seg27
        else
            SLCD_DATA1 &= ~(uint32_t)(0x8000000);
        break;
    }
    case RIQI: //日期 T8
    {
        if (disp)
            SLCD_DATA7 |= (uint32_t)(0x20); //com7,seg5
        else
            SLCD_DATA7 &= ~(uint32_t)(0x20);
        break;
    }
    case SHIJIAN: //时间 T9
    {
        if (disp)
            SLCD_DATA6 |= (uint32_t)(0x20); //com6,seg5
        else
            SLCD_DATA6 &= ~(uint32_t)(0x20);
        break;
    }
    case XINHAO: //信号 T20
    {
        if (disp)
            SLCD_DATA3 |= (uint32_t)(0x8000000); //com3,seg27
        else
            SLCD_DATA3 &= ~(uint32_t)(0x8000000);
        break;
    }
    case BIANKUANG: //边框 T1
    {
        if (disp)
            SLCD_DATA3 |= (uint32_t)(0x4000000); //com3,seg26
        else
            SLCD_DATA3 &= ~(uint32_t)(0x4000000);
        break;
    }
    default:
        break;
    }
}

/*!
    \brief      write one digit to the SLCD DATA register
    \param[in]  ch: the digit to write
    \param[in]  position: position in the SLCD of the digit to write
    \param[out] none
    \retval     none
*/
void slcd_seg_digit_display(uint8_t ch, uint8_t position)
{
    /* wait the last SLCD DATA update request finished */
    while(slcd_flag_get(SLCD_FLAG_UPR));

    /* SLCD write a char */
    slcd_seg_digit_write(ch, position);

    /* request SLCD DATA update */
    slcd_data_update_request();
}

/*!
    \brief      write a integer(6 digits) to SLCD DATA register
    \param[in]  num: number to send to SLCD(0-99999999)
    \param[out] none
    \retval     none
*/
void slcd_seg_number_display(uint32_t num)
{
    uint8_t i = 0x00, length, ch[8];

    ch[7] = num / 10000000;
    ch[6] = (num % 10000000) / 1000000;
    ch[5] = (num % 1000000) / 100000;
    ch[4] = (num % 100000) / 10000;
    ch[3] = (num % 10000) / 1000;
    ch[2] = (num % 1000) / 100;
    ch[1] = (num % 100) / 10;
    ch[0] = num % 10;
    
    if(ch[7]){
        length = 8;
    } else if(ch[6]) {
        length = 7;
    } else if(ch[5]) {
        length = 6;
    } else if(ch[4]) {
        length = 5;
    } else if(ch[3]) {
        length = 4;
    } else if(ch[2]) {
        length = 3;
    } else if(ch[1]) {
        length = 2;
    } else {
        length = 1;
    }

    slcd_seg_clear_all();
    /* wait the last SLCD DATA update request finished */
    while(slcd_flag_get(SLCD_FLAG_UPR));

    /* send the string character one by one to SLCD */
    while(i < length) {
        /* display one digit on SLCD */
        slcd_seg_digit_write(ch[i], 8 - i);
        /* increment the digit counter */
        i++;
    }

    /* request SLCD DATA update */
    slcd_data_update_request();
}
#if 0
/*!
    \brief      write a float number(6 digits which has 2 decimal) to SLCD DATA register
    \param[in]  num: number to send to SLCD
    \param[out] none
    \retval     none
*/
void slcd_seg_floatnumber_display(float num)
{
    uint8_t i = 0x00, length, ch[6];
    uint32_t temp;

    temp = (uint32_t)(num * 100);
    ch[5] = temp / 100000;
    ch[4] = (temp % 100000) / 10000;
    ch[3] = (temp % 10000) / 1000;
    ch[2] = (temp % 1000) / 100;
    ch[1] = (temp % 100) / 10;
    ch[0] = temp % 10;

    if(ch[5]) {
        length = 6;
    } else if(ch[4]) {
        length = 5;
    } else if(ch[3]) {
        length = 4;
    } else {
        length = 3;
    }

    slcd_seg_clear_all();
    /* wait the last SLCD DATA update request finished */
    while(slcd_flag_get(SLCD_FLAG_UPR));

    /* send the string character one by one to SLCD */
    while(i < length) {
        /* display one digit on SLCD */
        slcd_seg_digit_write(ch[i], 6 - i, FLOAT);
        /* increment the digit counter */
        i++;
    }

    /* request SLCD DATA update */
    slcd_data_update_request();
}
#endif
/*!
    \brief      write a digit to SLCD DATA register
    \param[in]  ch: the digit to write
    \param[in]  position: position in the SLCD of the digit to write,which can be 1..8
    \param[in]  type: the type of the data
    \param[out] none
    \retval     none
*/
void slcd_seg_digit_write(uint8_t ch, uint8_t position)
{
    /* wait the last SLCD DATA update request finished */
    while (slcd_flag_get(SLCD_FLAG_UPR))
    ;
    /* convert ASCii to SLCD digit or char */
    digit_to_code(ch);
   
    switch (position)
    {
    case 1:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG6) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFFFBF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFFFBF); //

