afantey/aft_bsp_gd32/gd32_drivers/slcd_seg_l23x.c
        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 6);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 6);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 6);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 6);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 6);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 6);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 6);
        break;
        
    case 2:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG10) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFFBFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFFBFF); //

        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 10);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 10);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 10);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 10);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 10);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 10);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 10);
        break;

    case 3:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG11) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFF7FF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFF7FF); //

        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 11);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 11);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 11);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 11);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 11);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 11);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 11);
        break;

    case 4:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG12) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFEFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFEFFF); //

        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 12);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 12);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 12);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 12);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 12);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 12);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 12);
        break;

    case 5:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG13) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFDFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFDFFF); //

        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 13);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 13);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 13);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 13);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 13);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 13);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 13);
        break;

    case 6:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG14) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFBFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFBFFF); //

        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 14);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 14);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 14);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 14);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 14);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 14);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 14);
        break;

    case 7:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG15) */
        SLCD_DATA7 &= (uint32_t)(0xFFFF7FFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFF7FFF); //

        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 15);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 15);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 15);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 15);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 15);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 15);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 15);
        break;

    case 8:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG25) */
        SLCD_DATA7 &= (uint32_t)(0xFDFFFFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFDFFFFFF); //

