afantey/aft_bsp_gd32/gd32_drivers/slcd_seg_l23x.c
        /* write the corresponding segments */
        SLCD_DATA7 |= (uint32_t)(digit[0] << 25);
        SLCD_DATA6 |= (uint32_t)(digit[1] << 25);
        SLCD_DATA5 |= (uint32_t)(digit[2] << 25);
        SLCD_DATA4 |= (uint32_t)(digit[3] << 25);
        SLCD_DATA2 |= (uint32_t)(digit[4] << 25);
        SLCD_DATA1 |= (uint32_t)(digit[5] << 25);
        SLCD_DATA0 |= (uint32_t)(digit[6] << 25);
        break;
    }
}

/*!
    \brief      clear data in the SLCD DATA register
    \param[in]  position: position in the SLCD of the digit to write,which can be 1..6
    \param[out] none
    \retval     none
*/
void slcd_seg_digit_clear(uint8_t position)
{
    /* wait the last SLCD DATA update request finished */
    while (slcd_flag_get(SLCD_FLAG_UPR))
        ;
    switch(position) {
    case 1:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG6) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFFFBF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFFFBF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFFFBF); //
        break;
		
    case 2:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG10) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFFBFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFFBFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFFBFF); //
        break;
		
    case 3:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG11) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFF7FF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFF7FF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFF7FF); //
        break;

    case 4:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG12) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFEFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFEFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFEFFF); //
        break;

    case 5:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG13) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFDFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFDFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFDFFF); //
        break;

    case 6:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG14) */
        SLCD_DATA7 &= (uint32_t)(0xFFFFBFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFFBFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFFBFFF); //
        break;

    case 7:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG15) */
        SLCD_DATA7 &= (uint32_t)(0xFFFF7FFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA5 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA4 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA2 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA1 &= (uint32_t)(0xFFFF7FFF); //
        SLCD_DATA0 &= (uint32_t)(0xFFFF7FFF); //
        break;

    case 8:
        /* clear the corresponding segments (COM7,6,5,4,2,0,1,SEG25) */
        SLCD_DATA7 &= (uint32_t)(0xFDFFFFFF); // SLCD_DATA7 > COM7
        SLCD_DATA6 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA5 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA4 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA2 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA1 &= (uint32_t)(0xFDFFFFFF); //
        SLCD_DATA0 &= (uint32_t)(0xFDFFFFFF); //
        break;
    }
}

/*!
    \brief      clear all the SLCD DATA register
    \param[in]  none
    \param[out] none
    \retval     none
*/
void slcd_seg_clear_all(void)
{
    /* wait the last SLCD DATA update request finished */
    while (slcd_flag_get(SLCD_FLAG_UPR))
        ;
    SLCD_DATA0 = 0x00000000;
    SLCD_DATA1 = 0x00000000;
    SLCD_DATA2 = 0x00000000;
    SLCD_DATA3 = 0x00000000;
    SLCD_DATA4 = 0x00000000;
    SLCD_DATA5 = 0x00000000;
    SLCD_DATA6 = 0x00000000;
    SLCD_DATA7 = 0x00000000;
}

void slcd_seg_full_screen(void)
{
    /* wait the last SLCD DATA update request finished */
    while (slcd_flag_get(SLCD_FLAG_UPR))
        ;
    SLCD_DATA0 = 0xFFFFFFFF;
    SLCD_DATA1 = 0xFFFFFFFF;
    SLCD_DATA2 = 0xFFFFFFFF;
    SLCD_DATA3 = 0xFFFFFFFF;
    SLCD_DATA4 = 0xFFFFFFFF;
    SLCD_DATA5 = 0xFFFFFFFF;
    SLCD_DATA6 = 0xFFFFFFFF;
    SLCD_DATA7 = 0xFFFFFFFF;
}
